{
  "public": {
    "asset_metadata": {
      "display_title": "Teaching Mrs. Tingle 1999",
      "movie_clips_id": "YczVaT_czPE",
      "info": {
        "copy_right": "TM & © Miramax Films (1999)",
        "run_time": "00:02:50.13",
        "synopsis": "Mrs. Tingle (Helen Mirren) snatches a copy of her final exam from Leigh Ann's (Katie Holmes) backpack, reveling in the fact that Leigh Ann's personal integrity -- and her graduation status -- now hang in the balance.",
        "talent": {
          "actor": [
            {
              "name": "Barry Watson",
              "talent_type": "Actor"
            },
            {
              "name": "Helen Mirren",
              "talent_type": "Actor"
            },
            {
              "name": "Katie Holmes",
              "talent_type": "Actor"
            },
            {
              "name": "Marisa Coughlan",
              "talent_type": "Actor"
            }
          ],
          "director": [
            {
              "name": "Kevin Williamson",
              "talent_type": "Director"
            }
          ],
          "producer": [
            {
              "name": "Ted Field",
              "talent_type": "Producer"
            },
            {
              "name": "Michael Finnell",
              "talent_type": "Producer"
            },
            {
              "name": "Gina Fortunato",
              "talent_type": "Producer"
            },
            {
              "name": "Cary Granat",
              "talent_type": "Producer"
            },
            {
              "name": "Paul Hellerman",
              "talent_type": "Producer"
            },
            {
              "name": "Erica Huggins",
              "talent_type": "Producer"
            },
            {
              "name": "Cathy Konrad",
              "talent_type": "Producer"
            },
            {
              "name": "Scott Kroopf",
              "talent_type": "Producer"
            },
            {
              "name": "Julie Plec",
              "talent_type": "Producer"
            },
            {
              "name": "Bob Weinstein",
              "talent_type": "Producer"
            },
            {
              "name": "Harvey Weinstein",
              "talent_type": "Producer"
            }
          ]
        },
        "release_year": "1999"
      },
      "title": "Teaching Mrs. Tingle (2/9) Movie CLIP - Caught Cheating (1999) HD",
      "query": "Caught Cheating",
      "film_description": "After the success of Scream, I Know What You Did Last Summer, and television's Dawson's Creek, screenwriter Kevin Williamson made his directorial debut with this screwball thriller in which an honor roll student and two friends kidnap their witchy teacher. Although her single mom (Lesley Ann Warren), a waitress, struggles to make ends meet, aspiring writer Leigh Ann Watson (Katie Holmes) works hard, avoids sexual temptation, and focuses on her studies. She hopes to make valedictorian and earn a scholarship to college -- and get away from her dead-end hometown. As her senior year draws to a close, however, she's dogged by harsh grades from her vituperative history instructor, Mrs. Tingle (Helen Mirren). On the same day she finds out that she's still in second place behind fellow valedictory candidate Mary Beth Carter (Liz Stauber), Leigh Ann must endure Mrs. Tingle's fierce criticism of the final project into which she's poured her heart. After commiserating with her best friend, aspiring actress Jo Lynn Jordan (Marisa Coughlan), and hunky stoner Luke Churner (Barry Watson), Leigh Ann runs even further afoul of Mrs. Tingle; Luke stashes an advance copy of the teacher's final exam in Leigh Ann's backpack and Tingle discovers it, promising to turn Leigh Ann in for cheating and ruin her chances of a better life. When the three teens turn up at Tingle's house to try to reason with her, Luke and Jo Lynn manage to accidentally kidnap Mrs. Tingle. Soon the three students are keeping their teacher a prisoner, trying to figure out how to blackmail her into silence while maintaining the illusion that nothing strange is going on. Teaching Mrs. Tingle was filmed under the name \"Killing Mrs. Tingle,\" but the title was changed after a rash of real-life high school killing sprees made the headlines."
    },
    "name": "Teaching Mrs. Tingle (2/9) Movie CLIP - Caught Cheating (1999) HD"
  }
}