{
  "public": {
    "asset_metadata": {
      "display_title": "Harry Potter and the Half-Blood Prince 2009",
      "movie_clips_id": "Xsa1B-RyyXQ",
      "info": {
        "copy_right": "TM & © Warner Bros. (2009)",
        "run_time": "00:01:58.08",
        "synopsis": "Harry (Daniel Radcliffe) uses a devastating spell during a fight with Draco (Tom Felton).",
        "talent": {
          "actor": [
            {
              "name": "Tom Felton",
              "talent_type": "Actor"
            },
            {
              "name": "Daniel Radcliffe",
              "talent_type": "Actor"
            },
            {
              "name": "Alan Rickman",
              "talent_type": "Actor"
            }
          ],
          "director": [
            {
              "name": "David Yates",
              "talent_type": "Director"
            }
          ],
          "producer": [
            {
              "name": "David Heyman",
              "talent_type": "Producer"
            },
            {
              "name": "Lionel Wigram",
              "talent_type": "Producer"
            },
            {
              "name": "Tim Lewis",
              "talent_type": "Producer"
            },
            {
              "name": "David Barron",
              "talent_type": "Producer"
            },
            {
              "name": "John Trehy",
              "talent_type": "Producer"
            }
          ],
          "screenplay": [
            {
              "name": "Steve Kloves",
              "talent_type": "Screenwriter"
            },
            {
              "name": "J.K. Rowling",
              "talent_type": "Screenwriter"
            }
          ]
        },
        "release_year": "2009"
      },
      "title": "Harry Potter and the Half-Blood Prince (1/5) Movie CLIP - Harry vs. Draco (2009) HD",
      "query": "Harry vs. Draco",
      "film_description": "Adolescent wizard-in-training Harry Potter returns to Hogwarts for another year of schooling and learns more about the dark past of the boy who grew up to become Lord Voldemort in this, the sixth installment of the film series that originated from the writings of author J.K. Rowling. There was a time when Hogwarts was thought of as a safe haven, but thanks to Voldemort's tightening grip on both the Muggle and wizarding worlds, that simply isn't the case anymore. Suspecting that the castle may even harbor an outright threat, Harry finds his investigation into the matter sidelined by Dumbledore's attempts to prepare him for the monumental battle looming ever closer on the horizon. In order to discover the key to Voldemort's defenses, Dumbledore enlists the aid of resourceful yet unsuspecting bon vivant Professor Horace Slughorn, who may have a clue as to their enemy's Achilles' heel. Meanwhile, teenage hormones cause the students at Hogwarts to lose focus on their true mission. As Harry and Dean Thomas clash for the affections of the lovely Ginny, Romilda Vane attempts to woo Ron away from Lavender Brown with some particularly tasty chocolates. Even Hermione isn't immune from the love bug, though she tries her hardest to suppress her growing jealousy and keep her emotions bottled up. But there is one student who remains completely aloof from the romance blossoming all around, and he intends to leave a dark impression on his classmates. With tragedy looming ever closer, it begins to appear as if peace will prove elusive in Hogwarts for some time to come."
    },
    "name": "Harry Potter and the Half-Blood Prince (1/5) Movie CLIP - Harry vs. Draco (2009) HD"
  }
}